# Data Science Level 2 실기 샘플문제

마케팅 전략을 수립하기 위해 신용 카드 고객을 대상으로 고객 세분화(Customer Segmentation) 및 예측 모델링을 수행하고자 한다.

**DS_Sample_1.csv** (구분자: comma(","), 1,000 Rows, 18 Columns, UTF-8 인코딩)

| 컬럼                             | 정의                                             | Type   |
|----------------------------------|--------------------------------------------------|--------|
| CUST_ID                          | 고객 ID                                          | Double |
| BALANCE                          | 연간 평균 잔고액                                 | Double |
| BALANCE_FREQUENCY                | 연중 잔고액 갱신 개월 수 비율 (0~1 사이값)       | Double |
| PURCHASES                        | 구매 총액                                        | Double |
| ONEOFF_PURCHASES                 | 일시불 구매 총액                                 | Double |
| INSTALLMENTS_PURCHASES           | 할부 구매 총액                                   | Double |
| CASH_ADVANCE                     | 현금서비스 구매 총액                             | Double |
| PURCHASE_FREQUENCY               | 연중 구매 개월 수 비율 (0~1 사이값)              | Double |
| ONEOFF_PURCHASES_FREQUENCY       | 연중 일시불 구매 개월 수 비율 (0~1 사이값)       | Double |
| PURCHASES_INSTALLMENTS_FREQUENCY | 연중 할부 구매 개월 수 비율 (0~1 사이값)         | Double |
| CASH_ADVANCE_FREQUENCY           | 연중 현금서비스 구매 개월 수 비율                | Double |
| CASH_ADVANCE_TRX                 | 현금 서비스 구매 횟수                            | Double |
| PURCHASES_TRX                    | 구매 횟수                                        | Double |
| CREDIT_LIMIT                     | 신용카드 한도                                    | Double |
| PAYMENTS                         | 지불 총액                                        | Double |
| MINIMUM_PAYMENTS                 | 기한 내 최소 지불 금액                           | Double |
| PRC_FULL_PAYMENT                 | 연중 기한 내 전액 지불 개월 수 비율 (0~1 사이값) | Double |
| TENURE                           | 신용카드 서비스 이용기간                         | Double |

분석을 수행하기 전, 상기 데이터를 이용하여 아래의 전처리를 수행하시오.

단계 1: '신용카드 한도(CREDIT_LIMIT)'와 '기한 내 최소 지불 금액(MINIMUM_PAYMENTS)'의 결측값(Null)을 각 컬럼의 평균값으로 대체하시오.

상기 전처리를 완료한 데이터셋(데이터셋명: **card1**)을 이용하여 다음 1~3번 문제에 답하시오.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../../../datasets/level2/DS_Sample_1.csv')

In [5]:
df.isna().sum()

CUST_ID                              0
BALANCE                              0
BALANCE_FREQUENCY                    0
PURCHASES                            0
ONEOFF_PURCHASES                     0
INSTALLMENTS_PURCHASES               0
CASH_ADVANCE                         0
PURCHASES_FREQUENCY                  0
ONEOFF_PURCHASES_FREQUENCY           0
PURCHASES_INSTALLMENTS_FREQUENCY     0
CASH_ADVANCE_FREQUENCY               0
CASH_ADVANCE_TRX                     0
PURCHASES_TRX                        0
CREDIT_LIMIT                         0
PAYMENTS                             0
MINIMUM_PAYMENTS                    74
PRC_FULL_PAYMENT                     0
TENURE                               0
dtype: int64

In [9]:
card1 = df.fillna(value={'CREDIT_LIMIT': df['CREDIT_LIMIT'].mean(), 'MINIMUM_PAYMENTS': df['MINIMUM_PAYMENTS'].mean()})

In [10]:
card1.isna().sum()

CUST_ID                             0
BALANCE                             0
BALANCE_FREQUENCY                   0
PURCHASES                           0
ONEOFF_PURCHASES                    0
INSTALLMENTS_PURCHASES              0
CASH_ADVANCE                        0
PURCHASES_FREQUENCY                 0
ONEOFF_PURCHASES_FREQUENCY          0
PURCHASES_INSTALLMENTS_FREQUENCY    0
CASH_ADVANCE_FREQUENCY              0
CASH_ADVANCE_TRX                    0
PURCHASES_TRX                       0
CREDIT_LIMIT                        0
PAYMENTS                            0
MINIMUM_PAYMENTS                    0
PRC_FULL_PAYMENT                    0
TENURE                              0
dtype: int64

In [11]:
card1.head()

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,10001.0,40.900749,0.818182,95.40,0.00,95.4,0.000000,0.166667,0.000000,0.083333,0.000000,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,10002.0,3202.467416,0.909091,0.00,0.00,0.0,6442.945483,0.000000,0.000000,0.000000,0.250000,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0
2,10003.0,2495.148862,1.000000,773.17,773.17,0.0,0.000000,1.000000,1.000000,0.000000,0.000000,0.0,12.0,7500.0,622.066742,627.284787,0.000000,12.0
3,10004.0,1666.670542,0.636364,1499.00,1499.00,0.0,205.788017,0.083333,0.083333,0.000000,0.083333,1.0,1.0,7500.0,0.000000,1297.116322,0.000000,12.0
4,10005.0,817.714335,1.000000,16.00,16.00,0.0,0.000000,0.083333,0.083333,0.000000,0.000000,0.0,1.0,1200.0,678.334763,244.791237,0.000000,12.0

**1. (card1을 이용하여)** '연간 평균 잔고액(BALANCE)'이 많을수록, 그리고 '신용카드 서비스 이용기간(TENURE)'이 길수록 '신용카드 한도(CREDIT_LIMIT)' 역시 높을 것으로 예상해볼 수 있다. 이들 변수 간의 관계를 파악하여, 추후 고객의 신용카드 한도 조정에 근거 자료로 활용하고자 한다.

'신용 카드 서비스 이용기간(TENURE)' 별로 '연간 평균 잔고액(BALANCE)'과 '신용카드 한도(CREDIT_LIMIT)'간 피어슨 상관 계수(Pearson Correlation Coefficient)를 계산하고, 이 중 가장 큰 값을 구하시오.

피어슨 상관 계수는 절대값을 취한 후, 이를 소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지 기술하시오. **(답안예시) 0.12**

In [17]:
card1.loc[:, 'TENURE'].unique()

array([12.,  8., 11.,  9., 10.,  7.,  6.])

In [110]:
card1.groupby('TENURE')[['BALANCE', 'CREDIT_LIMIT']].corr(method='pearson').round(2)

                     BALANCE  CREDIT_LIMIT
TENURE
6.0    BALANCE          1.00          0.87
       CREDIT_LIMIT     0.87          1.00
7.0    BALANCE          1.00          0.95
       CREDIT_LIMIT     0.95          1.00
8.0    BALANCE          1.00          0.82
       CREDIT_LIMIT     0.82          1.00
9.0    BALANCE          1.00          0.09
       CREDIT_LIMIT     0.09          1.00
10.0   BALANCE          1.00          0.29
       CREDIT_LIMIT     0.29          1.00
11.0   BALANCE          1.00          0.38
       CREDIT_LIMIT     0.38          1.00
12.0   BALANCE          1.00          0.46
       CREDIT_LIMIT     0.46          1.00

**2. (card1을 이용하여)** 신용카드 판매 전략을 수립하기 위해 고객 세분화(Customer Segmentation)를 수행할 수 있다. 일시불 구매 금액이 높은 고객 Segment를 도축하기 위해 다음
안계에 따라 분석을 수행하고 질문에 답하시오.

단계 1: '고객 ID(CUST_ID)'를 제외한 모든 변수(17개)에 대해 Z-score 표준화(Standardization)한다.

단계 2: 표준화된 변수들에 대해 K-means 군집 분석을 수행한다.
이 때, 군집 수는 2~5개 중 K-means Silhouette Coefficient가 최대가 되는 K를 설정한다.

단계 3: 단계 2에서 도출한 각 군집 별로 '일시불 구매 총액(ONEOFF_PURCHASES)'의 평균을 계산한다.

**[툴별 가이드]**

<table>
<tbody>
  <tr>
    <td>R</td>
    <td>library(cluster)<br>표준화 : scale() 함수의 center=T, scale=T 옵션 사용<br>군집화: cluster 학습 시마다 set.seed(12345) 선행 적용<br>Silhouette : silhouette() 함수의 sil_width 평균값 기준<br>문제 지시 외 Default 값 사용</td>
  </tr>
  <tr>
    <td>Python</td>
    <td>from sklearn.metrics import silhouette_samples, silhouette_score<br>from sklearn.cluster import KMeans<br>random_state=1234<br>문제 지시 외 Default 값 사용</td>
  </tr>
</tbody>
</table>

군집별 '일시불 구매 총액(ONEOFF_PURCHASES)'의 평균 중 가장 큰 값을 구하시오.

해당 값은 소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지 기술하시오.

**(답안예시) 1200.34**

In [23]:
from sklearn.metrics import silhouette_samples, silhouette_score
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler

In [36]:
card1_sub = card1.iloc[:, 1:]
card1_sub.head(2)

,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,40.900749,0.818182,95.4,0.0,95.4,0.000000,0.166667,0.0,0.083333,0.00,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,3202.467416,0.909091,0.0,0.0,0.0,6442.945483,0.000000,0.0,0.000000,0.25,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0

In [113]:
scaler = StandardScaler()
scaler.fit(card1_sub)
card1_scaled = scaler.transform(card1_sub)
# card1_scaled
card1_scaled_df = pd.DataFrame(card1_scaled, columns=card1_sub.columns)
card1_scaled_df.head(2)

,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,-0.848768,-0.419879,-0.441936,-0.374048,-0.395301,-0.482354,-0.872701,-0.804321,-0.719620,-0.684701,-0.457918,-0.564116,-1.161669,-0.557396,-0.443725,-0.465544,0.282429
1,0.282791,0.012131,-0.469017,-0.374048,-0.470304,1.878468,-1.282558,-0.804321,-0.924403,0.513493,0.065417,-0.628057,0.150025,0.360574,-0.086159,0.331592,0.282429

In [114]:
card1_sub_test = card1.drop(['CUST_ID'], axis=1)
card1_sub_test.head(2)

,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,40.900749,0.818182,95.4,0.0,95.4,0.000000,0.166667,0.0,0.083333,0.00,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,3202.467416,0.909091,0.0,0.0,0.0,6442.945483,0.000000,0.0,0.000000,0.25,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0

In [42]:
for i in range(2, 6):
    card1_tmp_df = card1_sub
    model = KMeans(n_clusters=i, random_state=1234)
    model.fit(card1_sub)
    card1_tmp_df['cluster'] = model.labels_
#     print(card1_tmp_df.head(2))
    print(i, silhouette_score(card1_sub, model.labels_))

2 0.49089414938562465
3 0.45205724129810076
4 0.3948768608934164
5 0.3803369900751684

In [44]:
# 위에서 K를 2로 설정했을 때 가장 성능이 좋으므로 K를 2로 설정함
card1_tmp_df = card1_sub
model = KMeans(n_clusters=2, random_state=1234)
model.fit(card1_sub)
card1_tmp_df['cluster'] = model.labels_
card1_tmp_df.groupby('cluster')[['ONEOFF_PURCHASES']].mean().round(2)

         ONEOFF_PURCHASES
cluster
0                  482.12
1                 3142.99

**3. (card1을 이용하여)** 이번에는 '일시불 구매 총액(ONEOFF_PURCHASES)' 예측 모델을 Target Marketing에 활용하고자 한다.
다음 단계에 따라 분석을 수행하고 질문에 답하시오.

단계 1: '고객 ID(CUST_ID)'가 4의 배수가 아닌 데이터를 Train Set으로, 4의 배수인 데이터를 Test Set으로 분할한다.

단계 2: Train Set으로 아래 조건에 따라 최대 깊이가 5인 의사결정나무 회귀모델(Decision Tree Regression Model)을 학습한다.

- 독립변수(총 16개): '고객 ID(CUST_ID)', '일시불 구매 총액(ONEOFF_PURCHASES)'을 제외한 모든 컬럼
- 종속변수: '일시불 구매 총액(ONEOFF_PURCHASES)'

<table class="tg">
<tbody>
  <tr>
    <td class="tg-0pky">R</td>
    <td class="tg-0pky">set.seed(1234)<br>library(tree)<br>Descition Tree Regression : rpart() 함수 사용<br>rpart() 함수에서 minsplit=2, cp=0<br>문제 지시 외 Default 값 사용<br></td>
  </tr>
  <tr>
    <td class="tg-0pky">Python</td>
    <td class="tg-0pky">from sklearn.tree import DecisionTreeRegressor<br>DecisionTreeRegressor에서 random_state=1234<br>문제 지시 외 Default 값 사용<br></td>
  </tr>
</tbody>
</table>

단계 3: 생성된 모델을 Test Set에 적용하여 '일시불 구매 총액(ONEOFF_PURCHASES)'을 예측한다.

단계 3에서 얻은 예측 결과를 평가하기 위해, 아래 정의된 Measure B를 구하시오.

$$
B=(\frac{1}{n}\Sigma^n_{i=1}(y_i-\hat{y}_l)^2)^\frac{1}{2}
$$

$$
\hat{y}_l: 예측값, y_i: 실제값
$$

B는 소수점 첫째 자리에서 반올림하여 정수 형태로 기술하시오.

**(답안예시) 1200**

In [87]:
# 단계 1

card1_train = pd.DataFrame(columns=card1.columns)
card1_test = pd.DataFrame(columns=card1.columns)

for i, row in card1.iterrows():
    if row['CUST_ID'] % 4 != 0:
        card1_train.loc[len(card1_train)] = row
    else:
        card1_test.loc[len(card1_test)] = row

print(card1_train.size)
print(card1_test.size)

13536
4464

In [88]:
# 단계 2
from sklearn.tree import DecisionTreeRegressor

In [118]:
model = DecisionTreeRegressor(max_depth=5, random_state=1234)
model.fit(X=card1_train.drop(['CUST_ID', 'ONEOFF_PURCHASES'], axis=1), y=card1_train['ONEOFF_PURCHASES'])

DecisionTreeRegressor(max_depth=5, random_state=1234)

In [124]:
# pred = model.predict(X=card1_test[card1_train.columns.difference(['CUST_ID', 'ONEOFF_PURCHASES'])])
pred = model.predict(X=card1_test.drop(['CUST_ID', 'ONEOFF_PURCHASES'], axis=1))

In [125]:
sum = 0
for i, row in card1_test.iterrows():
    sum += (row['ONEOFF_PURCHASES'] - pred[i]) ** 2
B = ((1 / len(card1_test)) * sum) ** 0.5

print(round(B))

2316

In [129]:
len(df.sample(frac=0.0123))

12

In [130]:
from sklearn.model_selection import train_test_split

df_train, df_test = train_test_split(df, train_size=0.8, random_state=123)

df_train.head(2)

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
512,10535.0,3718.606699,1.0,1172.68,1172.68,0.0,10372.849200,0.083333,0.083333,0.0,0.500000,10.0,7.0,9500.0,4820.842925,760.028047,0.0,12.0
685,10712.0,2892.138807,1.0,0.00,0.00,0.0,129.381701,0.000000,0.000000,0.0,0.333333,5.0,0.0,3000.0,666.956678,1066.060177,0.0,12.0

In [132]:
sepal_df = pd.read_csv('../../../datasets/iris.csv')
sepal_df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [134]:
sl_mean = sepal_df['Sepal.Length'].mean()
sl_std = sepal_df['Sepal.Length'].std()
print(sl_mean, sl_std)

5.843333333333334 0.828066127977863

In [136]:
cond_1 = sepal_df['Sepal.Length'] < (sl_mean - 1.5 * sl_std)
cond_2 = sepal_df['Sepal.Length'] > (sl_mean + 1.5 * sl_std)

len(sepal_df[cond_1 | cond_2])

21

In [137]:
bike_df = pd.read_csv('../../../datasets/bike.csv')
bike_df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [141]:
abs(bike_df['temp'] - bike_df['atemp']).mean()

3.509198511850083

In [162]:
bike_df['datetime'] = pd.to_datetime(bike_df['datetime'])

In [165]:
bike_df['date'] = bike_df['datetime'].dt.date

In [170]:
(bike_df.groupby('date')['casual'].max() > 25).sum()

384

In [173]:
bike_df['hour'] = bike_df['datetime'].dt.hour

In [178]:
hour_max = bike_df.groupby('hour')['registered'].mean().max()
hour_max_idx = bike_df.groupby('hour')['registered'].mean().idxmax()

print(hour_max, hour_max_idx)

393.32456140350877 17

In [179]:
a_df = pd.read_csv('../../../datasets/join_data_group_members.csv')
a_df.head(2)

    team    No member
0  TWICE  1414     미나
1  TWICE  1462     나연

In [180]:
b_df = pd.read_csv('../../../datasets/join_data_member_room.csv')
b_df.head(2)

   floor  room name
0      3  3G-A   미나
1      3  3G-B   나연

In [181]:
df_merged = pd.merge(left=a_df, right=b_df, left_on='member', right_on='name', how='left')
df_merged.head(2)

    team    No member  floor  room name
0  TWICE  1414     미나    3.0  3G-A   미나
1  TWICE  1462     나연    3.0  3G-B   나연

In [183]:
df_merged.isna().sum().max()

5

In [185]:
bike_df = pd.read_csv('../../../datasets/bike.csv')
bike_df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [186]:
bike_df['datetime'] = pd.to_datetime(bike_df['datetime'])
bike_df['hour'] = bike_df['datetime'].dt.hour

In [197]:
bike_df_s2 = bike_df[(bike_df['season'] == 2)]
bike_df_s2.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
1323,2011-04-01 00:00:00,2,0,1,3,10.66,12.88,100,11.0014,0,6,6,0
1324,2011-04-01 01:00:00,2,0,1,3,10.66,12.88,100,11.0014,0,4,4,1

In [198]:
bike_df_s4 = bike_df[(bike_df['season'] == 4)]
bike_df_s4.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
4055,2011-10-01 00:00:00,4,0,0,1,20.50,24.240,63,26.0027,24,106,130,0
4056,2011-10-01 01:00:00,4,0,0,1,19.68,23.485,67,22.0028,11,47,58,1

In [203]:
bike_df_s2_agg = bike_df_s2.groupby('hour')['registered'].mean().reset_index()
bike_df_s2_agg.head(2)

   hour  registered
0     0   45.947368
1     1   27.473684

In [204]:
bike_df_s4_agg = bike_df_s4.groupby('hour')['registered'].mean().reset_index()
bike_df_s4_agg.head(2)

   hour  registered
0     0   50.017544
1     1   30.842105

In [205]:
bike_df_agg = pd.merge(left=bike_df_s2_agg, right=bike_df_s4_agg, left_on='hour', right_on='hour')
bike_df_agg.head(2)

   hour  registered_x  registered_y
0     0     45.947368     50.017544
1     1     27.473684     30.842105

In [208]:
print(
    abs(bike_df_agg.iloc[:, 1] - bike_df_agg.iloc[:, 2]).idxmax(),
    abs(bike_df_agg.iloc[:, 1] - bike_df_agg.iloc[:, 2]).max()
)

19 30.9736842105263

In [217]:
bike_df = pd.read_csv('../../../datasets/bike.csv')
bike_df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [218]:
bike_df['datetime'] = pd.to_datetime(bike_df['datetime'])
bike_df['date'] = bike_df['datetime'].dt.date

In [236]:
bike_df_h100 = bike_df.groupby('date')['humidity'].max().reset_index()
bike_df_h100 = bike_df_h100.loc[bike_df_h100['humidity'] == 100,]
bike_df_h100.head(2)

          date  humidity
1   2011-01-02       100
20  2011-02-02       100

In [237]:
bike_df_merge = pd.merge(left=bike_df, right=bike_df_h100, left_on='date', right_on='date', how='inner')
bike_df_merge.loc[bike_df_merge['temp'] > 30,]['count'].mean()

338.75